[
  {
    "userName":"Ming Yangxue",
    "userAvatar":"",
    "times":"24 mins ago",
    "content":"This is a good thing in a branch, and it’s going to be a big brother.",
    "like":true,
    "respondMessage":[
      {
        "content":"On time, personal individuals have just received and issued the documents according to the regulations.",
        "userAvatar":"",
        "userName":"alone"
      },
      {
        "content":"How many ghosts are there, personal heads and people, each of them has a ghost place, a V-type from the four major",
        "userAvatar":"",
        "userName":"Second hair"
      },
      {
        "content":"In the introduction, we know that almost all objects in Flutter are a Widget. Unlike the 'controls' in native development, the concept of widgets in Flutter is more extensive. It can not only represent UI elements, but also express some functionality. Components such as",
        "userAvatar":"",
        "userName":"team"
      },
      {
        "content":"In Flutter, the function of the Widget is 'describe the configuration data of a UI element'. That is to say, the Widget is not actually a display element that is finally drawn on the device screen, but only a configuration number of the display element.",
        "userAvatar":"",
        "userName":"Hehe hot"
      }
    ]
  },
  {
    "userName":"Liu Fan",
    "userAvatar":"",
    "times":"1h",
    "content":"Place a ghost place, dye hair cream, play waste",
    "like":false,
    "respondMessage":[
      {
        "content":"UK and development are very disgusted, you are very disgusted and still let him also let his personal head brother",
        "userAvatar":"",
        "userName":"alone"
      }
    ]
  },
  {
    "userName":"Huger Alins",
    "userAvatar":"",
    "times":"1h",
    "content":"Widget is actually the configuration data of Element. The Widget tree is actually a configuration tree, and the real UI rendering tree is composed of Element. However, since Element is generated by Widget, there is a correspondence between them, so in most Scene, we can broadly think that the Widget tree refers to the UI control tree or UI.",
    "like":true,
    "index":2,
    "respondMessage":[
      {
        "content":"A get object can correspond to multiple Element objects. This is well understood, based on the same copy",
        "userAvatar":"",
        "userName":"alone"
      }
    ]
  }
]
